
{
  "data":[
    {
      "id": "อาบน้ำ",
      "content": "คุณแม่ที่ตั้งครรภ์สามารถอาบน้ำ ทำความสะอาดร่างกายได้บ่อยตามที่ต้องการเลยค่ะ จะอาบเวลากลางวันหรือกลางคืนก็ไม่มีใครว่าหรือมีข้อห้ามอะไรหรอกค่ะ อย่างที่ทราบกันดีอยู่แล้วว่าอากาศบ้านเราค่อนข้างร้อน การหมั่นอาบน้ำทำความสะอาดร่างกายจะทำให้เหงื่อไคลและกลิ่นตัวถูกกำจัดออกไปด้วยนะคะ"
    },
    { 
      "id": "ปัสสาวะ",
      "content": "เวลาเข้าห้องน้ำเพื่อปัสสาวะ ต้องทำความสะอาดบริเวณปากช่องคลอดให้ดีนะคะ การถ่ายปัสสาวะของคุณแม่ที่ตั้งครรภ์โดยเฉพาะรายที่ครรภ์แก่ บ่อยครั้งที่นั่งหรือลุกไม่ค่อยถนัด อาจทำให้ปัสสาวะรดเปื้อนบริเวณปากช่องคลอด ควรล้างด้วยน้ำสะอาดแล้วเช็ดให้แห้ง เวลาเช็ดให้แยกขาออกให้มากพอ อย่ารีบเช็ดเพราะอาจไม่แห้งพอ หลายคนชอบใช้กระดาษทิชชูเช็ดแทนการล้างช่องคลอด ดิฉันไม่ค่อยเห็นด้วยเพราะกระดาษทิชชูอาจเปื่อยหลุดเข้าไปในช่องคลอด ทำให้คันหรือตกขาวมีกลิ่นเหม็นได้ค่ะ"
    },
    { 
      "id": "อุจจาระ",
      "content": "ควรทำความสะอาดก้นโดยการล้างน้ำ ถ้าจะใช้กระดาษชำระเช็ดก้น ควรเช็ดจากด้านหน้าไปทางด้านหลัง อย่าเช็ดจากด้านหลังมาด้านหน้า เพราะอาจทำให้อุจจาระมาเปื้อนบริเวณปากช่องคลอดได้นะคะ"
    },
    { 
      "id": "แต่งตัว",
      "content": "คุณแม่อยากจะใส่เสื้อผ้าสวยแค่ไหนก็ใส่ไปเถอะค่ะ แต่ขอให้เป็นเสื้อผ้าที่หลวมๆ โปร่งๆ จะได้ไม่อึดอัด เนื่องจากบ้านเรามีแต่ฤดูร้อนและฤดูโคตรร้อน การแต่งชุดที่คับๆหรือรัดๆมีหวังทรมานแย่เลยค่ะ"
    },
    {
      "id": "การดูแลผิวพรรณ",
      "content": "คุณแม่ควรหมั่นทาครีมที่ช่วยบำรุงความชุ่มชื้นให้กับผิวหนังอย่างสม่ำเสมอ หลีกเลี่ยงการเกาที่บริเวณต่างๆ ของร่างกาย โดยเฉพาะบริเวณหน้าท้อง เพราะยิ่งเกาจะยิ่งไปกระตุ้นให้ร่างกายมีการสร้างสารพวกเมลานิน ซึ่งจะทำให้ผิวหนังบริเวณที่เกามีสีคล้ำขึ้นนะคะ"
    },
    { 
      "id": "ยาหรือครีมลดท้องลาย",
      "content": "ในปัจจุบันไม่มียาหรือครีมชนิดใดเลยที่ได้รับการยอมรับว่ามีประโยชน์ในการลบหรือลดภาวะท้องลายได้ค่ะ"
    },
    {
      "id": "ย้อมหรือไฮไลต์สีผม",
      "content": "การเสริมสวยขณะตั้งครรภ์ก็ไม่มีข้อห้ามอะไรหรอกค่ะอยากจะย้อมหรือไฮไลต์สีผมก็เชิญตามสบาย ไม่ต้องกลัวเป็นอันตรายต่อลูกนะคะ"
    },
    {
      "id": "แต่งหน้าทาปาก",
      "content": "ทำได้ตามสบายเลย ไม่เป็นอันตรายต่อลูกค่ะ"
    },
    {
      "id": "การทาเล็บ",
      "content": "เวลาตั้งครรภ์คุณแม่อาจจะซีดได้ ซึ่งคุณหมอจะรู้ได้ด้วยการดูสีเลือดใต้เล็บ ดังนั้น คุณแม่ที่ทาเล็บเวลาท้องอาจทำให้คุณหมอดูไม่ออกว่าคุณแม่ซีดหรือไม่ซีด ถ้าเลิกทาเล็บตอนท้องได้ก็จะดีนะคะ"
    },
    {
      "id": "แหวน",
      "content": "ตอนท้องคุณแม่อาจจะบวมได้และนิ้วมือก็เป็นอวัยวะที่บวมได้บ่อยๆ ยิ่งใกล้คลอดจะยิ่งบวมมาก บางรายบวมมากจนแหวนรัดนิ้วซะเน่าเลยก็มีนะคะ "
    },
    {
      "id": "รองเท้า",
      "content": "รองเท้าที่ใส่ก็เป็นเรื่องสำคัญอีกอย่างที่ต้องระวัง คุณแม่ที่ตั้งครรภ์ไม่ว่าจะเพิ่งเริ่มตั้งครรภ์หรือตั้งครรภ์มานานแล้วก็ตาม ควรใส่รองเท้าส้นเตี้ยหรือไม่มีส้น เป็นรองเท้าเรียบๆ เลยก็ดี เพราะการใส่รองเท้าส้นสูงขณะตั้งครรภ์จะทำให้ล้มได้ง่าย รวมทั้งยังเพิ่มการปวดหลังที่พบได้บ่อยอยู่แล้วให้เป็นรุนแรงขึ้นค่ะ"
    },
    {
      "id": "ใส่ตุ้มสะดือ",
      "content": "ดิฉันอยากเตือนว่าต้องระวังว่าอาจจะทำให้เกิดการติดเชื้อที่บริเวณสะดือนะคะ ถ้ารักษาความสะอาดได้ไม่ดีพอ และ ยิ่งท้องโตขึ้นเรื่อยๆ หน้าท้องก็จะตึงมากขึ้นเรื่อยๆเช่นกัน เวลาใส่ตุ้มสะดืออาจทำให้เป็นแผลคล้ายมีดบาดได้นะคะ"
    },
    {
      "id": "สัก",
      "content": "ควรระวังนะคะ บางคนสักเป็นรูปมังกรผงาดฟ้ามา แต่หลังคลอดอาจจะกลายเป็นแย้ย่างคอห้อยก็ได้ค่ะ"
    },
    {
      "id": "เพศสัมพันธ์",
      "content": "คุณแม่สามารถมีเพศสัมพันธ์ได้ตลอดช่วงที่ตั้งครรภ์ จะมีช่วงที่อยากให้งดเว้นหรือเพลาๆ บ้างก็เฉพาะช่วงตั้งครรภ์ประมาณ 2-3 เดือนแรก เพราะอาจจะทำให้แท้งได้ค่ะ"
    },
    {
      "id": "เดินห้าง",
      "content": "คุณแม่ที่ตั้งครรภ์สามารถเดินห้างได้ค่ะ แต่ข้อควรระวังก็คือ อย่าเดินนาน ต้องมีเวลานั่งพักเป็นระยะๆ เพื่อจะได้ไม่ปวดหลังมากและขาจะได้ไม่บวมค่ะ"
    },
    { 
      "id": "การทำงาน",
      "content": "คนท้องทำงานได้ไม่มีข้อห้ามค่ะ เพียงแต่อย่าทำงานที่ทำให้เหนื่อยมาก ถ้าเป็นการทำงานนั่งโต๊ะไม่หนักหนาอะไรก็เชิญทำได้ตามสบาย แต่ถ้าเป็นงานที่ทำแล้วเครียด อดตาหลับขับตานอน อย่างนี้ต้องเลิกหรือเพลาๆ ลงค่ะ"
    },
    {
      "id": "หน้าจอคอมพิวเตอร์",
      "content": "คุณแม่ยุคใหม่จำนวนไม่น้อยต้องทำงานหน้าจอคอมพิวเตอร์นานๆ หลายคนกลัวว่าจะเป็นอันตรายต่อลูกในท้อง ขอเรียนว่าจอคอมพิวเตอร์ไม่ได้ปล่อยแสงหรือคลื่นประหลาดอะไรออกมาทำให้ลูกคุณพิการหรอกค่ะ เพียงแต่ถ้านั่งแช่อยู่นานๆ คุณแม่ก็จะปวดหลังได้ง่ายเท่านั้นเองค่ะ"
    },
    {
      "id": "การเดินทาง",
      "content": "คุณแม่จะเดินทางไปไหนก็ได้ไม่มีปัญหา ยกเว้นแต่ว่าจะมีปัญหาที่เขาไม่ให้ไป เช่น เครื่องบินที่เขาไม่ให้ขึ้นตอนท้องแก่ๆ เพราะกลัวจะไปคลอดบนเครื่องบิน เขาไม่มีคนทำคลอดให้ค่ะ "
    },
    {
      "id": "ขับรถเอง",
      "content": "ขับได้ค่ะไม่ห้าม แต่ต้องใส่เซฟตี้เบลท์ให้ดีก็แล้วกัน สำหรับเรื่องนี้ดิฉันอยากเตือนนิดหนึ่งก็คือว่า ตอนที่ตั้งท้องใหม่ๆ คุณแม่จะง่วงง่าย แพ้ท้องอ่อนระโหยโรยแรง ดังนั้น เวลาขับรถมีโอกาสที่จะเหม่อลอยและขับรถไปชนกับรถคนอื่นได้ ช่วงเวลานี้คุณแม่จึงควรที่จะงดการขับรถไว้ก่อน อีกช่วงเวลาหนึ่งคือตอนใกล้คลอด ท้องของคุณแม่จะใหญ่มากจนไปค้ำพวงมาลัย ทำให้ขับรถยาก อึดอัด ถ้าเบรกกะทันหัน ท้องอาจจะกระแทกพวงมาลัยจนทำให้แท้งหรือรกลอกตัวก่อนกำหนด ซึ่งจะทำให้ลูกเป็นอันตรายได้ค่ะ"
    },
    {
      "id": "ทำฟัน",
      "content": "การทำฟันขณะตั้งครรภ์เป็นเรื่องที่ทำได้ค่ะ เพียงแต่ต้องให้ความระมัดระวังมากอีกหน่อย เพราะคุณแม่ขณะตั้งครรภ์จะมีโอกาสเลือดออกได้เยอะเวลาทำฟัน หมอฟันจึงมักที่จะหลีกเลี่ยงที่จะทำฟันตอนท้อง แต่ถ้าจำเป็นจริงๆ ก็ทำได้ รายละเอียดเกี่ยวกับเรื่องนี้อยากให้คุณแม่ลองปรึกษากับหมอฟันดูนะคะ"
    },
    {
      "id": "ออกกำลังกาย",
      "content": "คนท้องออกกำลังกายได้ แต่อย่าให้เหนื่อยมากนะคะ "
    },
    {
      "id": "วิธีการออกกำลังกาย",
      "content": "คุณแม่ไม่ควรออกกำลังกายโดยการกระโดดโลดเต้นโดยเด็ดขาด เพราะเป็นอันตราย วิธีการที่อยากแนะนำคือ เดินเร็วๆ นั่งเหยียดแข้งขา ก้มตัวบิดไปมา หรือว่ายน้ำ ค่ะ"
    },
    {
      "id": "การใช้ยา",
      "content": "คุณแม่ที่ตั้งครรภ์ควรหลีกเลี่ยงการซื้อยามารับประทาน ฉีด หรือเหน็บเอง แม้ว่ายาส่วนมากจะปลอดภัย แต่ก็มียาหลายชนิดที่อาจจะเป็นอันตรายต่อร่างกายของคุณแม่เอง หรือต่อลูกในท้องได้ ซึ่งไม่สามารถจะแจกแจงได้ทั้งหมด ณ ที่นี้ ถ้าจะให้ดีก่อนใช้ยาทุกชนิดปรึกษาคุณหมอที่ดูแลก่อนจะดีกว่าค่ะ"
    },
    {
      "id": "แพ้ท้อง",
      "content": " การดื่มน้ำขิง หรือรับประทานขนมปังแคร็กเกอร์ จะช่วยลดอาการดังกล่าวได้ค่ะ  นอกจากนี้ คุณแม่ควรงดรับประทานอาหารมันๆ หรืออาหารที่มีไขมันสูง ในกรณีที่อาการไม่ดีขึ้น รับประทานอาหารไม่ได้ คุณแม่ควรรีบไปพบแพทย์ค่ะ"
    },
    { 
      "id": "ปัสสาวะบ่อย",
      "content": "ไม่ใช่อาการผิดปกติค่ะ คุณแม่ควรดื่มน้ำมากๆ และไม่ควรกลั้นปัสสาวะ แต่ถ้ามีอาการปัสสาวะแล้วรู้สึกปวดบริเวณท้องน้อย คุณแม่ควรรีบไปพบแพทย์ทันทีนะคะ เพราะอาจมีการติดเชื้อในระบบทางเดินปัสสาวะร่วมด้วยค่ะ"
    },
    {
      "id": "เหนื่อยง่ายเวลาออกแรง",
      "content": "ในกรณีที่ตรวจไม่พบความผิดปกติที่ทำให้มีอาการเหนื่อยง่าย การนอนหลับพักผ่อนให้เพียงพอ จะสามารถบรรเทาอาการดังกล่าวได้ค่ะ"
    },
    {
      "id": "ริดสีดวงทวารหนัก",
      "content": "ควรดื่มน้ำในปริมาณไม่ต่ำกว่า 8 แก้วต่อวัน ร่วมกับรับประทานผักผลไม้ และอาหารที่มีกากใยสูง การนั่งแช่ก้นในน้ำอุ่น อาจจะช่วยลดขนาดและบรรเทาอาการเจ็บปวดบริเวณริดสีดวงทวารหนักได้ค่ะ"
    },
    {
      "id": "คัดตึงเต้านม",
      "content": "การสวมใส่เสื้อชั้นในที่ออกแบบมาสำหรับสตรีตั้งครรภ์โดยเฉพาะจะช่วยบรรเทาอาการคัดตึงเต้านมได้ค่ะ"
    },
    {
      "id": "คันบริเวณหน้าท้อง",
      "content": "การทาครีมที่มีส่วนผสมของมอยส์เจอร์ไรเซอร์บริเวณหน้าท้อง อาจช่วยลดอาการคันลงได้นะคะ"
    },
    {
      "id": "ปวดเมื่อยบริเวณหลัง",
      "content": "คุณแม่ควรหลีกเลี่ยงการยกของหนัก รองเท้าที่สวมใส่ควรเป็นชนิดแบนราบ ในการนั่งทำงานควรนั่งหลังตรงพิงพนักเก้าอี้ เพื่อป้องกันอาการปวดหลังค่ะ"
    },
    {
      "id": "ตะคริวที่ขา",
      "content": "เวลาเกิดตะคริว ให้ลองยืดขาทั้งสองข้างออก ร่วมกับนวดและประคบด้วยน้ำอุ่นบริเวณขาที่เกิดตะคริวค่ะ"
    },
    {
      "id": "เท้าบวม",
      "content": "เมื่อมีอาการบวมที่เท้าทั้งสองข้าง ให้นั่งยกเท้าทั้งสองข้างให้สูงขึ้น ร่วมกับสวมใส่ถุงน่องเพื่อพยุงขา และออกกำลังกายบริเวณข้อเท้าทั้งสองข้างค่ะ"
    },
    {
      "id": "ป้องกันเส้นเลือดขอดที่ขา",
      "content": "คุณแม่ควรออกกำลังกายสม่ำเสมอ ไม่ควรนั่งไขว่ห้าง เวลานั่งควรนั่งยกเท้าทั้งสองข้างให้สูงขึ้น และควรสวมใส่ถุงน่องเพื่อพยุงขาทั้งสองข้างค่ะ"
    },
    { 
      "id": "ท้องอืดหลังรับประทานอาหาร",
      "content": "ควรรับประทานอาหารในปริมาณน้อยแต่บ่อยมื้อ หลีกเลี่ยงอาหารมันๆ และไม่ควรเอนตัวลงนอนทันทีหลังรับประทานอาหาร ในกรณีที่มีอาการแสบร้อนบริเวณหน้าอก การดื่มนมอาจช่วยบรรเทาอาการลงได้นะคะ"
    },
    {
      "id": "ท้องลาย",
      "content": "วิธีการบรรเทาการท้องลายคือ การรับประทานอาหารในปริมาณที่เพียงพอกับความต้องการของร่างกาย ดื่มน้ำในปริมาณมาก และทาครีมป้องกันหน้าท้องลายเป็นประจำ อาจช่วยลดการเกิดหน้าท้องลายได้นะคะ"
    },
    {
      "id": "เลือดออกจากช่องคลอด",
      "content": "อาการเลือดออกจากช่องคลอดเป็นอาการนำของภาวะแทรกซ้อนขณะตั้งครรภ์ได้หลายประการ เช่น การแท้งบุตร การตั้งครรภ์นอกมดลูก การตั้งครรภ์ไข่ปลาอุก ซึ่งทั้ง 3 ภาวะพบได้บ่อยในระยะแรกของการตั้งครรภ์ อีกสาเหตุคือรกต่ำและลอกตัวก่อนกำหนดที่พบได้บ่อยในช่วงท้ายของการตั้งครรภ์หรือแม้แต่เป็นอาการนำของการคลอดบุตรก็ยังได้ค่ะ"
    },
    {
      "id": "แพ้ท้องรุนแรง",
      "content": "แม้ว่าเราจะสามารถพบอาการแพ้ท้องรุนแรงได้ในครรภ์ปกติ แต่ก็มีภาวะปกติบางอย่างขณะตั้งครรภ์ที่พบร่วมกันได้บ่อยๆ เช่น การตั้งครรภ์แฝดและการตั้งครรภ์ไข่ปลาอุก เป็นต้น ดังนั้น หากมีอาการแพ้ท้องรุนแรงก็แนะนำให้ไปพบคุณหมอเช่นเดียวกันค่ะ"
    },
    {
      "id": "เจ็บครรภ์คลอดก่อนกำหนด",
      "content": "ในการตั้งครรภ์ปกติ มดลูกของคุณแม่จะมีการบีบตัวตลอดเวลาอยู่แล้ว แต่จะเป็นจังหวะที่ไม่สม่ำเสมอ แต่เมื่อใดก็ตามที่คุณแม่สังเกตว่าท้องตึงหรือแข็ง (บางคนอาจปวดหลังบริเวณกระเบนเหน็บ) เป็นจังหวะสม่ำเสมอ อาจจะทุกๆ 10-15 นาที ให้พึงระวังว่านี่อาจจะเป็นสัญญาณเตือนของการเจ็บครรภ์ก่อนกำหนด และควรรีบไปพบแพทย์โดยทันทีค่ะ"
    },
    {
      "id": "น้ำเดิน",
      "content": "เมื่อไรก็ตามที่มีน้ำเดิน คุณแม่ต้องรีบไปหาคุณหมอในทันที เพราะการที่ปล่อยให้มีน้ำเดินนานๆ ทำให้มีโอกาสเสี่ยงต่อการติดเชื้อในโพรงมดลูกได้สูง และยังเป็นอันตรายต่อทารกในครรภ์อีกด้วยค่ะ"
    },
    {
      "id": "ปวดศีรษะ/ตามัว/จุกแน่นใต้ลิ้นปี่",
      "content": "ภาวะนี้ถือเป็นภาวะแทรกซ้อนขณะการตั้งครรภ์ที่มีอันตรายทั้งต่อชีวิตคุณแม่และลูกน้อยในครรภ์ พบได้บ่อยในช่วงท้ายของการตั้งครรภ์ โดยเฉพาะคุณแม่ที่เป็นวัยรุ่น คุณแม่ที่อายุมาก หรือคุณแม่ที่มีโรคประจำตัวบางชนิด เช่น โรคเบาหวาน โรคความดันโลหิตสูง และโรคไต เป็นต้นค่ะ"
    },
    {
      "id": "ลูกดิ้นลดลงหรือไม่ดิ้น",
      "content": "ในระยะนี้การนับจำนวนครั้งของการดิ้นของลูกว่ายังเท่าๆ เดิมทุกวันนับว่าเป็นกระบวนการสำคัญที่ขอแนะนำให้คุณแม่ทำทุกวันค่ะ เพราะการดิ้นของลูกที่ลดลงเป็นสัญญาณเตือนถึงอันตรายที่กำลังกำเนิดขึ้นกับลูกน้อยในครรภ์ โดยเฉพาะอย่างยิ่งภาวะขาดออกซิเจน"
    },
    {
      "id": "ไข้ระหว่างการตั้งครรภ์",
      "content": " ไข้อาจมีสาเหตุมาจากหลายประการ แต่ที่พบบ่อยๆในขณะตั้งครรภ์ก็คือการติดเชื้อในระบบทางเดินปัสสาวะและโรคติดต่อต่างๆ เช่น ไข้เลือดออก ไข้หวัดใหญ่ เป็นต้น หากคุณมีอาการไข้ ก็ขอให้รีบไปพบแพทย์เพื่อรับการตรวจและรักษาแต่เนิ่นๆ อย่าซื้อยารับประทานเองเป็นอันขาด เพราะอาจทำให้การวินิจฉัยโรคล่าช้า และยังอาจมีอันตรายจากการซื้อยารับประทานเองอีกด้วยค่ะ"
    },
    { 
      "id": "ความจำเป็นของอาหารขณะตั้งครรภ์",
      "content": "คุณแม่บางคนเกรงว่าตัวเองจะรับประทานอาหารมากเกินไป ทำให้เสียทรวดทรงและลูกอาจตัวโตคลอดยาก จึงพยายามควบคุมอาหาร ความคิดเช่นนี้ไม่ถูกต้องนะคะ เพราะลูกจะคลอดยากหรือง่ายไม่ได้อยู่ที่ขนาดของลูกอย่างเดียว แต่ยังขึ้นอยู่กับขนาดของเชิงกรานคุณแม่และการหดรัดตัวของมดลูกของคุณแม่ขณะเจ็บท้องคลอดด้วย นอกจากนี้ การพยายามควบคุมอาหารอาจทำให้ลูกที่คลอดออกมาตัวเล็กกว่าปกติและไม่แข็งแรงได้ค่ะ"
    },
    {
      "id": "อาหารเสริมขณะตั้งครรภ์",
      "content": "อาหารเสริม ในทางการแพทย์หมายถึงสารอาหารที่คุณแม่ควรรับประทานนอกเหนือไปจากการรับประทานอาหารประจำวันตามปกติ เนื่องจากถ้าไม่รับประทานอาจทำให้คุณแม่ได้สารอาหารไม่เพียงพอได้ สารอาหารที่มีความจำเป็นต้องได้รับเพิ่มเติมจากการรับประทานตามปกติมีไม่กี่ชนิด ได้แก่ ธาตุเหล็ก กรดโฟลิก และแคลเซียม ค่ะ"
    },
    {
      "id": "คลอดตอนไหน",
      "content": "ต้องอธิบายกันอย่างนี้ค่ะ คุณหมอกับคุณแม่นับอายุครรภ์ไม่เหมือนกัน เพราะคุณหมอนับอายุครรภ์เป็นสัปดาห์ ทั้งนี้ การตั้งครรภ์ปกติจะครบกำหนดคลอดที่อายุครรภ์ 40 สัปดาห์ หรือ 10 เดือน หากคิดว่าเดือนหนึ่งมี 4 สัปดาห์และคุณแม่จะคลอดครบกำหนดที่ช่วงอายุครรภ์ 37-42 สัปดาห์ ซึ่งถือว่าเป็นระยะ เวลาการคลอดที่ปกติ ขณะที่คุณแม่มักจะนับอายุครรภ์เป็นเดือน แต่อย่าลืมนะคะ ว่าบางเดือนก็มี 5 สัปดาห์ ทำให้รวมไปรวมมานับได้ 9 เดือนค่ะ"
    },
    {
      "id": "อาการแบบนี้แหละที่คุณแม่กำลังจะคลอด",
      "content": "เจ็บครรภ์หรือเจ็บท้อง เป็นอาการที่พบบ่อยที่สุดที่จะนำคุณแม่ทั้งหลายไปสู่การคลอด เริ่มต้นคุณแม่ส่วนใหญ่มักจะรู้สึกตึงหลังบริเวณกระเบนเหน็บเป็นพักๆ ก่อน และมีน้ำเดิน น้ำใส ๆ หรืออาจปนสีเขียวที่ไหลออกจากช่องคลอด โดยที่คุณแม่ไม่ได้ปวดหรือเบ่งปัสสาวะ ทั้งยังไหลออกมาในปริมาณมากจนถึงข้อเท้าหรือนองพื้นค่ะ"
    },
    {
      "id": "เวลาคลอดเจ็บไหม",
      "content": "ไม่อยากตอบให้เสียน้ำใจ แต่ต้องบอกจริงๆ อย่างตรงไปตรงมาว่า “เจ็บ” ค่ะ แต่เดี๋ยวก่อน! คุณแม่อย่าเพิ่งกลัวกันมากไป เพราะคุณหมอเองก็ไม่ใช่พวกซาดิสม์ที่ชอบเห็นคนเจ็บปวดนะคะ คุณหมอก็จะมีวิธีการลดหรือระงับความเจ็บปวดหลายวิธีค่ะ แต่ที่ใช้กันบ่อย ๆ ก็ได้แก่ การนวดกดจุดคลายอาการเจ็บครรภ์,การฉีดยาแก้ปวดเข้าทางหลอดเลือดดำ,การฉีดยาชาลดอาการปวดเข้าไขสันหลัง หรือการบล็อกหลัง วิธีการเหล่านี้ล้วนมีประสิทธิภาพและสามารถลดความเจ็บปวดขณะเจ็บครรภ์ได้เป็นอย่างดีค่ะ"
    },
    {
      "id": "คุณพ่อกับการคลอด",
      "content": "สิ่งแรกที่คุณพ่อต้องทราบก็คือ การตั้งครรภ์มักจะสร้างความเครียดให้คุณแม่เสมอ และคุณพ่อเท่านั้นที่จะเป็นผู้ช่วยลดความเครียดดังกล่าว ด้วยการให้ความเอาใจใส่และให้กำลังใจกับคุณแม่ตั้งแต่เริ่มตั้งครรภ์ ช่วยเหลือกิจกรรมบางอย่างที่คุณแม่อาจทำได้น้อยลง เช่น งานบ้าน เป็นต้น นอกจากนี้ อย่าลืมแสดงความรักสม่ำเสมอด้วยการ หอมแก้ม ประคองแขน หรือจูงมือเวลาเดิน รวมทั้งบอกรักบ่อย ๆ ก็ดีนะคะ"
    },
    {
      "id": "เตรียมตัวไปคลอด",
      "content": "หากไม่มีการจัดเตรียมข้าวของที่จำเป็นไว้เสียก่อนก็คงต้องย้อนกลับบ้านไปเอามาใหม่ ซึ่งของบางอย่างเป็นสิ่งสำคัญที่ต้องนำไปโรงพยาบาลโดยเฉพาะอย่างยิ่งสมุดหรือใบฝากครรภ์ เมื่อเข้าใกล้ระยะคลอด โดยเฉพาะอย่างยิ่งช่วงเดือนสุดท้ายก่อนครบ กำหนดคลอด คุณพ่อคุณแม่ต้องเตรียมบางสิ่งบางอย่างให้พร้อมสำหรับการไปนอนโรงพยาบาลเพื่อคลอดอย่างน้อย 2-3 วันสำหรับการคลอดปกติ และ 4-5 วัน หากได้รับการผ่าตัดคลอด นอกจากนี้ ยังมีสิ่งของที่คุณแม่ไม่ควรนำติดตัวไปโรงพยาบาล ขณะคลอดด้วยนะคะ ได้แก่ เงินสด บัตรเครดิต เครื่องประดับและของมีค่า โทรศัพท์มือถือราคาแพง สร้อยคอ หรือนาฬิกาข้อมือ ค่ะ"
    },
    {
      "id": "ของแสลง",
      "content": " ตามความหมายนี้คุณแม่ที่ตั้งครรภ์ก็ไม่มีอาหารแสลงอะไรนะคะ สามารถรับประทานอาหารต่างๆ ได้เช่นเดียวกับขณะที่ไม่ตั้งครรภ์ จะมีอาหารหรือเครื่องดื่มเพียงบางชนิดที่พอจะเรียกว่าแสลงต่อการตั้งครรภ์ที่ควรลดการบริโภคลง หรือควรงดเว้นขณะตั้งครรภ์ค่ะ "
    },

        {
      "id": "น้ำหนักในช่วงตั้งครรภ์",
      "content": "โดยปกติแล้ว น้ำหนักของคุณแม่จะเพิ่มขึ้นประมาณ 12 – 15 กิโลกรัมตลอดอายุของการตั้งครรภ์ หรือเฉลี่ยประมาณ 0.4 กิโลกรัมต่อสัปดาห์จึงจะเหมาะสมครับ"
    },
    {
      "id": "ดื่มกาแฟ",
      "content": "ผลวิจัยล่าสุดยืนยันว่า คนท้องกินกาแฟวันละถ้วยไม่มีผลเสียต่อการพัฒนาสติปัญญาหรือพฤติกรรมของทารกน้อยในครรภ์ของคุณ เป็นเรื่องน่ายินดีใช่ไหมคะ"
    },
    {
      "id": "เซ็กส์ระหว่างตั้งครรภ์",
      "content": "การมีเซ็กส์ระหว่างตั้งครรภ์นั้น น้อยมากที่จะเป็นอันตรายกับลูกในท้อง เพียงแต่แม่ท้องต้องหมั่นสังเกตอาการผิดปกติเมื่อมีเพศสัมพันธ์ เช่นมีเลือดออกทางช่องคลอด หรือมีอาการเจ็บครรภ์ หากมีอาการดังกล่าวควรรีบไปพบคุณหมอทันที"
    },
    {
      "id": "วัคซีนต่างๆระหว่างตั้งครรภ์",
      "content": "กระทรวงสาธารณสุขของประเทศไทย รวมถึง องค์การอนามัยโลกได้กำหนด วัคซีนบาดทะยักให้เป็นวัคซีนจำเป็นสำหรับแม่ตั้งครรภ์ต้องฉีดทุกราย  สำหรับวัคซีนไข้หวัดใหญ่ควรปรึกษาสูติแพทย์ก่อนฉีด  วัคซีนป้องกันหัดเยอรมัน ห้ามฉีดขณะตั้งครรภ์โดยเด็ดขาด "
    },
    {
      "id": "การใช้ยาอันตรายยารักษาสิว",
      "content": "ยารักษาสิวบางกลุ่มทั้งชนิดทาและชนิดรับประทาน เช่น ยากลุ่มกรดวิตามินเอ หรือเอตินอยด์ จัดเป็นยาอันตรายที่อาจส่งผลร้ายต่อทารกในครรภ์ถึงขั้นพิการได้ ดังนั้นจึงควรปรึกษาคุณหมอก่อนที่จะใช้ยาต่างๆ รวมถึงก่อนการรับยาควรแจ้งทุกครั้งว่าตั้งครรภ์"
    },
    {
      "id": "ควรทานวิตามินเสริมหรือยาบำรุง",
      "content": "แม่ท้องควรทานอาหารให้ครบห้าหมู่ นอกเหนือจากนั้น สารอาหารที่แม่ท้องควรได้รับเพิ่มเติมคือ ธาตุเหล็ก ซึ่งจะช่วยสนับสนุนการทำงานของฮีโมโกบินในเม็ดเลือดแดง ที่จะเป็นตัวนำออกซิเจนไปสู่ลูกน้อยในครรภ์ อีกทั้งยังช่วยป้องกันภาวะโลหิตจางได้อีกด้วย แต่อย่างไรก็ตาม แม่ท้องไม่ควรรับประทานเองโดยปราศจากคำแนะนำจากคุณหมอนะคะ"
    },
    {
      "id": "ดื่มนมวัว",
      "content": "หากแม่ท้องดื่มนมวัวก็จะทำให้ระดับแคลเซียมของแม่ท้องนั้นเพิ่มมากขึ้น ซึ่งจะเป็นการช่วยบำรุงกระดูกและฟันของทารกในครรภ์ อีกทั้งยังช่วยป้องกันภาวะความดันโลหิตสูงได้อีกด้วย"
    },
    {
      "id": "ริดสีดวง",
      "content": "จากการที่มดลูกขยายใหญ่ขึ้นจนมีการกดทับลำไส้ใหญ่ ทำให้การทำงานของระบบขับถ่ายไม่สมบูรณ์ นอกจากนี้ ผลจากการเปลี่ยนแปลงของฮอร์โมนในช่วงที่มีการตั้งครรภ์ อาจทำให้หลอดเลือดบริเวณรอบทวารหนักเกิดการขยายตัวและโป่งพอง จึงทำให้เกิดอาการท้องผูกได้ง่ายขึ้นจนเป็นสาเหตุของอาการริดสีดวงทวารในระหว่างตั้งครรภ์"
    },
    {
      "id": "ปวดนิ้วมือนิ้วเท้า",
      "content": "การเปลี่ยนแปลงของฮอร์โมนในร่างกายระหว่างตั้งครรภ์ส่งผลให้เส้นเอ็นคลายตัว จึงทำให้เกิดการหย่อนตัวของข้อต่อกระดูก  ในขณะเดียวกันกล้ามเนื้อก็ทำงานมากขึ้น จึกเกิดอาการปวดข้อตามมา"
    },
    {
      "id": "การดื่มนม",
      "content": "การดื่มนมบำรุงครรภ์ ไม่จำเป็นต้องเป็นนมสำหรับคนท้อง แต่ถ้าจะเลือกดื่มก็ไม่ผิดแต่จะมีราคาสูงและสารอาหารไม่แตกต่าง นมวัวสามารถดื่มได้ในปริมาณที่พอเหมาะคือ 1 – 2 แก้วต่อวัน สำหรับคุณแม่ที่ชอบดื่มนมถั่วเหลือง ควรเพิ่มปริมาณเป็นสองเท่าของนมวัว หรือ ชดเชยด้วยการรับประทานผักเเคลเซี่ยมสูงชดเชยได้ นมแนะนำควรเป็นนมรสจืด เพราะรสหวานอาจมีผลต่อระดับน้ำตาลในเลือดได้"
    },       
    {
      "id": "อัลตร้าซาวด์",
      "content": "ไม่เป็นค่ะ การอัลตร้าซาวด์ไม่มีผลต่อทารกในครรภ์ เพราะใช้คลื่นความถี่ในช่วงที่ปลอดภัยต่อทั้งแม่และลูก"
    },
    {
      "id": "นอนคว่ำ",
      "content": "คนท้อง นอนคว่ําได้ไหม นั่นสินะ จะไปทับลูกในท้องหรือเปล่า คำตอบคือ ไม่ค่ะ เพราะทารกนอนอยู่ในถุงน้ำคร่ำ ถ้าแม่นอนทับด้านหนึ่ง ท้องก็จะไปปูดออกอีกด้าน วิธีหนึ่งที่จะช่วยให้คุณแม่สบายขึ้นเมื่อนอนคว่ำคือ ใช้หมอนรองบริเวณต้นขา และคอ ศีรษะตะแคงไปด้านใดด้านหนึ่งสำหรับท่านอนคนท้องที่เหมาะคือท่านอนตะแคง น้ำหนักของท้องส่วนหนึ่งตกลงที่พื้น ทำให้ไม่มีแรงกดบนเส้นเลือดใหญ่ในช่องท้อง ป้องกันเลือดคั่งบริเวณขาส่วนล่างได้ดี หากใช้หมอนรองไว้ระหว่างขาทั้งสองข้างบริเวณใต้เข้า หรือนอนกอดหมอนข้างจะช่วยให้คุณแม่นอนสบาย ซึ่งท่านอนตะแคงซ้ายจะลดแรงกดดันเส้นเลือดใหญ่ได้ดีกว่าท่านอนตะแคงขวา"
    },   
    {
      "id": "ห้ามวิ่ง",
      "content": "แม่บางคนที่มีอาการแพ้ท้องหนักมาก ไม่ได้ออกกำลังกายเป็นประจำ หรือมีโรคประจำตัว รวมถึงเสี่ยงต่อภาวะแทรกซ้อน เราอยากแนะนำให้ปรึกษาคุณหมอก่อนที่จะหักโหมออกกำลังกาย แต่ก็มีแม่ ๆ ที่ร่างกายแข็งแรงดี ออกกำลังกายเป็นประจำ สามารถวิ่งออกกำลังกายได้ ดังนั้น ข้อห้ามที่ว่า คนท้องห้ามวิ่งเด็ดขาด ก็ไม่ใช่สำหรับทุกคน"
    },
    {
      "id": "ป่วยกินยา",
      "content": "ไม่ใช่ยาทุกชนิดที่ปลอดภัยสำหรับทารกขณะต้ังครรภ์ กรุณาปรึกษาคุณหมอก่อนเสมอ อย่าเชื่อคำพูดที่เล่าต่อกันมาโดยไม่มีการรับรอง (รวมถึงยาสมุนไพรด้วย)"
    },
    {
      "id": "บุหรี่",
      "content": "บุหรี่มีสารเคมีหลายตัวที่เป็นพิษต่อเด็กในครรภ์ ทั้งควันที่เกิดจากการเผาไหม้ยังทำให้ออกซิเจนไปเลี้ยงทารกได้น้อยลง"
    },
    {
      "id": "เหล้า",
      "content": "แอลกอฮอล์ในเหล้าทำลายระบบสมองและประสาทของเด็กได้ เพิ่มโอกาสในการแท้งบุตร ส่งผลต่อพัฒนาการของลูกหลังคลอด สมาธิสั้น และเพิ่มโอกาสพิการ (ทั้งนี้ไม่แนะนำให้ดื่มเหล้าตั้งแต่ตั้งครรภ์ไปจนคลอดและยังให้นมบุตรอยู่)"
    },

    {
      "id": "ทำให้ลูกโต",
      "content": "ร่างกายของทารกสร้างจากโปรตีนเป็นหลัก ตามคำแนะนำของแพทย์หญิงตั้งครรภ์ควรบริโภคไข่ไม่เกินวันละ 1 ฟอง (คนปกติไม่เกิน 3 ฟอง/อาทิตย์) และกินอาหารให้หลากหลายรวมทั้งผักและผลไม้เพื่อให้ได้วิตามินและเกลือแร่ที่มีประโยชน์ต่อร่างกาย การกินขนมหวานที่มีไขมันและน้ำตาลมาก จะทำให้น้ำหนักตัวของคุณแม่เพิ่มแต่ไม่ช่วยให้ลูกโต และจะคงค้างหลังคลอดได้ง่าย"
    },
    {
      "id": "น้ำมะพร้าว",
      "content": "มีความเชื่อว่าน้ำมะพร้าวจะช่วยให้เด็กออกมาขาวและไม่มีไข ซึ่งไม่เป็นความจริง ความขาวของลูกมาจากพันธุกรรมของพ่อแม่ และไขมันที่ติดออกมาจากตัวลูกตอนคลอดก็เป็นธรรมชาติที่สร้างไว้ปกป้องการสูญเสียความร้อนออกจากร่างกายเด็ก จริงๆแล้วน้ำมะพร้าวมีเกลือแร่และวิตามินที่มีประโยชน์แต่มีน้ำตาลที่สูงมาก การกินบ่อยครั้ง จะเพิ่มความเสี่ยงให้คุณแม่เป็นเบาหวานในช่วงตั้งครรภ์ (ทุเรียนก็น้ำตาลสูงเช่นกัน)"
    },
    {
      "id": "ทุเรียน",
      "content": "สามารถกินได้วันละ 1 พูเท่านั้นค่ะ หากคุณแม่กินมากกว่านี้ เพราะในทุเรียนจะมีธาตุโพแทสเซียมและน้ำตาลสูง ส่งผลให้น้ำหนักตัวคุณแม่เพิ่มขึ้นอย่างรวดเร็ว ยิ่งคุณแม่มีภาวะเสี่ยงเป็นโรคเบาหวาน โรคอ้วน โรคหัวใจ โรคความดันโลหิตสูง ยิ่งไม่ควรกินเลยค่ะ"
    },
    {
      "id": "เพลงโมสาท",
      "content": "เป็นความผิดพลาดของสื่อมวลชนที่สื่อสารออกไปให้คนเข้าใจผิดมากที่สุดเรื่องนึง การวิจัยเรื่องเพลงโมสาทมีผลต่อความเรียนรู้ของเด็กนั้นถูกทดสอบที่เด็กในระดับชั้นเล็กๆไม่ใช่ในท้อง และผลการทดสอบคือ การฟังเพลงโมสาทน้อยกว่า 10 นาทีต่อวัน ช่วยกระตุ้นด้านการศึกษามิติสัมพันธ์ในเด็กได้ดีขึ้น ไม่ใช่ฉลาดขึ้นทุกเรื่องอย่างที่ข่าวสื่อออกไป ในทางกลับกันพบว่าการฟังเพลงคลาสิกอาจทำให้คุณแม่ที่ไม่คุ้นเคยเกิดความเครียดได้แทน"
    },
    {
      "id": "เสียงดนตรี",
      "content": "มีการศึกษาพบว่าเสียงดนตรีสามประเภทคือ กลอง เครื่องสาย(เช่นกีตาร์) และเปียใน ส่งผลกระตุ้นสมองต่างส่วนกัน และเสียงเครื่องดนตรีประเภทเปียโนดีต่อการพัฒนาสมองด้านความคิดและอารมณ์มากที่สุด ในขณะที่เสียงเพลงประเภทกลองไม่ค่อยเหมาะกับการให้ทารกในครรภ์ฟัง เนื่องจากเสียงจะไปตีกับเสียงหัวใจที่ดังภายในตัวแม่"
    },
    {
      "id": "ความเครียดของแม่ ",
      "content": "ความเครียดของแม่สามารถส่งผลโดยตรงต่อทารกในครรภ์ และยับยั้งพัฒนาการของสมองเด็ก ดังนั้นไม่ว่าจะเป็นการทะเลาะกันภายในครอบครัว ฟังเพลงคลาสิกที่ไม่ชอบมากไป อารมณ์เสีย ทำงานหนักไป ล้วนทำให้เด็กลดพัฒนาการลง วิธีแก้คือ ไม่เครียด ปล่อยวาง และทำให้คุณแม่อารมณ์ดีอยู่ตลอดเวลา (อันนี้เป็นหน้าที่คุณพ่อและคนในครอบครัวช่วยกันดูแล)"
    },
    {
      "id": "เก้าอี้โยก",
      "content": "มีผลการทดสอบพบว่าช่วยกระตุ้นให้เด็กรับรู้และมีพัฒนาการด้านการทรงตัวได้ดี และยังมีประโยชน์กับผู้สูงอายุที่นั่งเก้าอี้โยกบ่อยจะลดความเสี่ยงของโรคน้ำในหูไม่เท่ากัน"
    },
    {
      "id": "การพูดคุยกับเด็ก",
      "content": "ช่วยสร้างปฏิสัมพันธ์และกระตุ้นให้เด็กคุ้นเคยกับเสียงของพ่อแม่ (มีการทดสอบในไทย พบว่าลูกจำเสียงพูดและเสียงหัวใจของแม่ได้ตั้งแต่คลอดออกมา – หยุดร้องเมื่อได้ยินเสียงแม่พูด หรือนอนแนบอกแม่ได้ยินเสียงหัวใจแม่เต้น) และเมื่อเปรียบเทียบกับเสียงของพ่อที่ทุ้มกว่า ลูกจะจำได้ดีกว่า"
    },
    {
      "id": "คนท้องขึ้นเครื่องบิน",
      "content": "ปกติที่อนุญาติคือช่วงไตรมาส 2 (เดือน 4 – 6) จะมีความเสี่ยงต่ำสุด แต่ทั้งนี้ขึ้นอยู่กับข้อบังคับของแต่ละสายการบินด้วย"
    },
    {
      "id": "ลูกสะอึก",
      "content": "ส่วนของปอดเริ่มทำงานและเด็กเริ่มกลืนเป็น ไม่อันตรายอะไร"
    },
    {
      "id": "รักษาฟัน",
      "content": "คุณแม่ควรไปพบทันตแพทย์ในช่วงไตรมาสสอง (อายุครรภ์ 4-6 เดือน) เพื่อดูแลสุขภาพฟันให้แข็งแรง เพราะการมีฟันผุจะเพิ่มความเสี่ยงในการคลอดก่อนกำหนดได้"
    },
    {
      "id": "อาหารที่ควรหลีกเลี่ยง ",
      "content": "งดเครื่องดื่มที่มีคาเฟอีน, งดเครื่องดื่มแอลกฮอล์, งดทานปลาทะเล, หลีกเลี่ยงสับปะรด, ลดเนื้อสัตว์"
    },
    {
      "id": "เจาะถุงน้ำคร่ำ",
      "content": "เจาะผ่านกล้ามเนื้อมดลูกที่เป็นตัวป้องกันอยู่ภายนอกของถุงน้ำคร่ำ เมื่อเจาะได้น้ำคร่ำแล้วก็จะถอนเข็มที่ใช้เจาะออก แล้วกล้ามเนื้อมดลูกก็จะหดรัดตัวตามธรรมชาติมาปิดรอยเจาะเอาไว้ นอกจากนี้เข็มที่ใช้เจาะน้ำคร่ำนั้นมีขนาดเล็กจึงไม่มีผลทำให้เกิดรอยรั่วที่ถุงน้ำคร่ำมากนัก"
    },
    {
      "id": "นมสำหรับคนท้อง",
      "content": "เเม่ท้องควรดื่มนมวันละ 3 เเก้ว เเต่ก็ขึ้นอยู่กับน้ำหนักเเละส่วนสูงของคุณเเม่เเต่ละคนด้วย ดูเเละโภชนาการให้ครบ 5 หมู่ควบคู่กับการดื่มนมไปด้วย หากสามารถดื่มนมได้ทุกชนิด ก็ควรจะบริโภคให้หลากหลายสลับกันไปนะคะ"
    },
    {
      "id": "ภาวะครรภ์เสี่ยง",
      "content": "เป็นสภาวะที่อาจเกิดอันตรายหรือเสียชีวิตต่อแม่และทารกในครรภ์ ซึ่งเกิดขึ้นได้จากปัจจัยหลายอย่างเช่น โรคประจำตัวของคุณแม่เอง เคยมีประวัติคลอดบุตรยาก เคยผ่าตัดมดลูก เคยแท้งบุตร รวมถึงคุณแม่ที่ตั้งครรภ์ขณะมีอายุตั้งแต่ 35 ปีขึ้นไป โดยแม่ท้องควรรีบไปฝากครรภ์ที่โรงพยาบาล ซึ่งคุณหมอจะทำการวินิจฉัยภาวะเสี่ยง และแม่ท้องควรทำตามคำแนะนำของคุณหมออย่างเคร่งครัด"
    },
    {
      "id": "เนื้องอกระหว่างตั้งครรภ์",
      "content": "ความเสี่ยงจากการที่แม่ท้องมีเนื้องอกระหว่างตั้งครรภ์นั้นจะแตกต่างกันออกไป ขึ้นอยู่กับตำแหน่งและลักษณะของเนื้องอกนั้นๆ หากสงสัยหรือตรวจพบ แม่ท้องควรรีบปรึกษาคุณหมอเพื่อรับการวินิจฉัยและทำการรักษาด้วยวิธีที่เหมาะสมต่อไป"
    },
    {
      "id": "แกงบอน",
      "content": "เรื่องนี้เป็นเรื่องของความเชื่อค่ะ เพราะยังไม่มีผลวิจัยยืนยันว่าทานแล้วมีผลทำให้รกเปื่อยหรือไม่ แต่ที่ไม่แนะนำให้คุณแม่ทาน เนื่องจากว่า แกงบอน หากนำมาปรุงโดยปฏิบัติไม่ถูกต้องแล้ว จะเกิดอาการคันปากคันคอ และผู้ปรุงอาหารจากบอนเองก็จะคันมือด้วยค่ะ"
    },
    {
      "id": "ลาบดิบ",
      "content": "ในอาหารดิบเหล่านี้ส่วนมากจะมีพยาธิค่ะ ถ้าในร่างกายคุณแม่พยาธิเยอะ อาจทำให้มีการแย่งสารอาหารจากตัวคุณแม่ทำให้คุณแม่ขาดสารอาหาร และ คุณแม่บางคนกินแล้วอาจจะทำให้ท้องร่วง อาหารเป็นพิษได้ค่ะ"
    },
    {
      "id": "ซูชิ",
      "content": "ควรหลีกเลี่ยงไปก่อนจะดีกว่านะคะ เพื่อความปลอดภัยทั้งต่อแม่ท้องและทารกในครรภ์จะดีที่สุดค่ะ"
    },
    {
      "id": "เบียร์",
      "content": "ควรจะงดดื่มเบียร์โดยเฉพาะเบียร์ของประเทศไทยมีปริมาณแอลกอฮอล์ค่อนข้างสูง หันไปดื่มน้ำผลไม้แทนจะมีประโยชน์ต่อการตั้งครรภ์มากกว่า"
    },
    {
      "id": "ชาดอกคำฝอย",
      "content": "เป็นเครื่องดื่มที่ควรหลีกเลี่ยงเพื่อความปลอดภัยของคุณแม่เองและทารกน้อยในครรภ์ค่ะเพราะ ดอกคำฝอยมีสรรพคุณในเรื่องแก้ประจำเดือนมาไม่ปรกติ คือ การขับเลือดนั่นเอง  เป็นสมุนไพรที่มีฤทธิ์สามารถทำให้มดลูกเกิดการบีบตัว ถือเป็นอันตรายอย่างยิ่งสำหรับแม่ตั้งครรภ์ "
    },
    {
      "id": "ชาสมุนไพร",
      "content": "ชาสมุนไพร แม้จะไม่มีคาเฟอีนแต่ต้องระวังเป็นพิเศษ เพราะสมุนไพรหลายชนิดยังไม่มีการศึกษาความปลอดภัยในคนตั้งครรภ์ยกเว้น ชาเปปเปอร์มินต์ และชาขิง ซึ่งช่วยบรรเทาอาการแพ้ท้อง และจัดว่าปลอดภัย"
    },
    {
      "id": "ชาขิง",
      "content": "แก้คลื่นไส้อาเจียน"
    },
    {
      "id": "ชาตะไคร้",
      "content": "ช่วยย่อยอาหาร แก้วิงเวียน"
    },
    {
      "id": "ชาใบเตย",
      "content": "ช่วยคลายร้อนหอมชื่นใจ และลดน้ำตาลในเลือด"
    },
    {
      "id": "ชามะตูม",
      "content": "มีกลิ่นหอมหวานบำรุงธาตุ แก้ร้อนใน"
    },
    {
      "id": "ชาโป๊ยกั๊ก",
      "content": "ชาโป๊ยกั๊ก หรือโป๊ยกั๊กที่เป็นเครื่องเทศในผงพะโล้ มีส่วนช่วยในระบบย่อยอาหาร บรรเทาอาการท้องอืด ท้องเฟ้อ จุกเสียด แน่นท้อง อาเจียน และช่วยย่อยอาหารย่อยยาก ปรับการทำงานของลำไส้ให้เป็นปกติ"
    },
    {
      "id": "ชาเปปเปอร์มินต์",
      "content": "มีคุณสมบัติช่วยเร่งการย่อยอาหารให้เร็วขึ้น ทำให้เรารู้สึกกระฉับกระเฉง สดชื่น"
    },
    {
      "id": "ชากุหลาบ",
      "content": "ช่วยบรรเทาอาการท้องผูก ช่วยลดการอักเสบของผิว  อุดมไปด้วยวิตามิน A, B3, C, D และ E ที่มีส่วนเกี่ยวข้องกับการดูแลผิวพรรณ"
    },
    {
      "id": "ชาเขียว",
      "content": "ในแง่ของคาเฟอีนนั้น ไม่ใช่ไม่มีเลยนะค่ะ เพียงแต่ปริมาณต่อ 1 ถ้วยอยู่ที่ประมาณ 10-50 มิลลิกรัมเท่านั้น ถ้าเทียบแล้วแตกต่างกับกาแฟลิบลับ ดังนั้น ชาเขียวจึงไม่ใช่ข้อห้ามสำหรับคุณแม่ตั้งครรภ์ เพียงแต่ไม่ควรดื่มบ่อยนัก"
    },
    {
      "id": "เครื่องดื่มที่มีปริมาณคาเฟอีน",
      "content": "ไม่ควรดื่มเครื่องดื่มที่มีปริมาณคาเฟอีนเกิน 100 มิลลิกรัมต่อวัน เพราะจะทำให้แท้งง่ายค่ะ"
    },
    {
      "id": "ชานมไข่มุก",
      "content": "ชานมไข่มุกมีปริมาณของแป้งมันสำปะหลังในเม็ดไข่มุก รวมทั้งความหวานมันและคาเฟอีนจากชา เลี่ยงได้จะดีกว่าค่ะ"
    },
    {
      "id": "กุ้งเต้น",
      "content": "ไม่ควรทาน ถึงแม้ของเหล่านี้จะมีคุณค่าก็ตาม เพราะอาหารดิบที่ไม่ผ่านกระบวนการปรุงให้สุก มีผลเสียต่อคุณแม่และลูกน้อยในครรภ์ให้มีโอกาสเสี่ยงต่อโรคพยาธิ เชื้อโรค สารปนเปื้อนต่างๆที่มากับของดิบ ดังนั้นเพื่อความปลอดภัยควรทานอาหารที่ปรุงสุกเท่านั้น"
    },
    {
      "id": "ส้มตำ",
      "content": " ปลาร้าหรือปูดองที่ใส่ในส้มตำ ซึ่งจัดเป็นของดิบ เสี่ยงต่อการเกิดอาหารเป็นพิษจากเชื้อแบคทีเรียที่ปนเปื้อนมาได้ รวมถึงการใส่ผงชูรสและปริมาณเกลือที่อยู่ปูดองหรือปลาร้าก็จะทำให้เสี่ยงต่ออาการบวมและอาการความดันโลหิตสูงระหว่างตั้งครรภ์ได้"
    },
    {
      "id": "ทดแทนนม",
      "content": " สามารถทาน กินปลาตัวเล็กน้อย, กินผลิตภัณฑ์อื่นที่ทำจากนม เช่น ชีส โยเกิร์ต ,กินธัญพืช เช่น ถั่วเหลือง ถั่วแดง เต้าหู้ ลูกเดือย ซีเรียล งาดำ เป็นต้น,กินถั่วต่าง ๆ และเต้าหู้ , กินผักใบเขียวและผลไม้ เช่น ผักบร็อกโคลี คะน้า ผักโขม  แครอท แคนตาลูป น้ำผลไม้ เป็นต้น, กินไข่, เนื้อสัตว์ และ  อาหารทะเลอื่น ๆ เช่น ปลาทะเล กุ้ง ปลาหมึก เพื่อช่วยป้องกันการขาดสารไอโอดีน"
    },
    {
      "id": "กิมจิ",
      "content": " ควรเลือกกิมจิที่ได้มาตรฐานและเก็บในอุณหภูมิที่เหมาะสม เพื่อป้องกันการเจริญเติบโตของเชื้อโรค"
    },
    {
      "id": "กินรสจัด",
      "content": "การรับประทานเผ็ด หรืออาหารรสจัดระหว่างตั้งครรภ์นั้นจะส่งผลต่อสุขภาพของแม่ท้องแน่ ๆ ซึ่งหากทานเผ็ดมาก อาจทำให้เกิดอาการปวดท้อง มีปัญหาเรื่องระบบย่อยและกระเพาะอาหาร และอาจมีอาการอย่างอื่นแทรกซ้อนตามมา ลักษณะอาการแบบนี้แหละที่จะส่งผลกระทบได้ต่อตัวแม่และลูกน้อยในครรภ์"
    },
    {
      "id": "ปลาแซลมอน",
      "content": "ไม่ควรทาน ถึงแม้ของเหล่านี้จะมีคุณค่าก็ตาม เพราะอาหารดิบที่ไม่ผ่านกระบวนการปรุงให้สุก มีผลเสียต่อคุณแม่และลูกน้อยในครรภ์ให้มีโอกาสเสี่ยงต่อโรคพยาธิ เชื้อโรค สารปนเปื้อนต่างๆที่มากับของดิบ ดังนั้นเพื่อความปลอดภัยควรทานอาหารที่ปรุงสุกเท่านั้น"
    },
    {
      "id": "มะม่วงหาวมะนาวโห่",
      "content": "คนตั้งครรภ์ ไม่ควรทานนะคะ เพราะมะม่วงหาวมะนาวโห่ จะไปช่วยจัดการระบบเลือดในร่างกายเรา ซึ่งอาจจะมีผลตอนคลอดค่ะ"
    },
    {
      "id": "ยาระบาย",
      "content": " การทานยาระบายจะส่งผลให้ร่างกายเสียน้ำและเกลือแร่ ซึ่งจะเป็นผลให้ความดันโลหิตลดต่ำลง หัวใจเต้นเร็ว แล้วส่งผลถึงทารกในครรภ์ด้วย"
    },
    {
      "id": "กินคลีน",
      "content": "สามารถกินคลีนได้ แต่ต้องคำนึงถึงสารอาหารที่ครบถ้วน 5 หมู่ และมีปริมาณแคลอรีที่พียงพอในหนึ่งวันประมาณ 2,500 กิโลแคลอรี เพื่อใช้เป็นพลังงานและสารสำคัญในร่างกายเยอะเพื่อให้ลูกในท้องแข็งแรงสมบูรณ์ "
    },
    {
      "id": "ถั่วงอก",
      "content": "ไม่ควรกินถั่วงอกดิบ ถั่วงอกดิบจะมีสารไฟเตต ทำให้ไปขัดขวางการดูดซึมธาตุแคลเซียม เหล็ก สังกะสี และแร่ธาตุตัวอื่นๆ ที่จำเป็นสำหรับร่างกาย"
    },
    {
      "id": "ว่านหางจระเข้",
      "content": "มีฤทธิ์เร่งการจับตัวของเลือดทำให้เลือดคั่งในมดลูก และมดลูกบีบตัวดังนั้นหญิงที่อยู่ในระยะตั้งครรภ์จึงควรเลี่ยงเนื่องจากเสี่ยงต่อภาวะแท้งบุตรหรือคลอดก่อนกำหนดได้ "
    },
    {
      "id": "ปลาร้า",
      "content": "ปลาร้าและปูดองมีโอกาสปนเปื้อนทั้งเชื้อพยาธิและแบคทีเรียสูง เสี่ยงติดเชื้ออาหารเป็นพิษ จึงไม่แนะนำให้คุณแม่รับประทาน นอกจากนี้ยังมีเกลือสูงทำให้คุณแม่ตั้งครรภ์บวมมากขึ้นอีกด้วย"
    },    {
      "id": "โกโก้",
      "content": "โกโก้จัดอยู่ในประเภทเครื่องดื่มที่มีคาเฟอีน เหมือนชา และกาแฟ ซึ่งคาเฟอีนนั้นถือเป็นอาหารประเภทที่คุณแม่ไม่ควรรับประทาน หรือต้องจำกัดปริมาณที่ได้รับในแต่ละวันค่ะ เพราะถ้าหากคุณแม่ตั้งครรภ์ได้รับคาเฟอีนในปริมาณที่มากเกินไป อาจเป็นปัจจัยเสี่ยงที่ส่งผลต่อลูกน้อยในครรภ์ได้"
    },
    {
      "id": "กรดไหลย้อน",
      "content": "พยายามหลีกเลี่ยงอาหารมัน อาหารรสเผ็ดจัด เปรี้ยวจัด อาหารที่ย่อยยาก ควรรับประทานอาหารทีละน้อยๆ แต่ให้บ่อยมื้อขึ้น หลีกเลี่ยงการดื่มชา กาแฟ ไม่ควรนอนหลังรับประทานอาหารทันที ควรทิ้งเวลาอย่างน้อยสัก 3 ชั่วโมงหลังรับประทานอาหารแล้วจึงค่อยนอน โดยควรนอนหัวสูง และสวมใส่เสื้อผ้าหลวมสบายๆ"
    },
    {
      "id": "เบื่ออาหาร",
      "content": "ความเบื่ออาหารของแม่ท้องมีผลกับลูกน้อยในท้อง หากช่วงไตรมาสแรก แม่มีอาการแพ้ท้องหนัก ก็ยังไม่ต้องกังวลมาก เพราะ 3 เดือนแรก ลูกในท้องจะได้รับสารอาหารจากถุงไข่แดง หลังจากเข้าสู่ไตรมาสที่ 2 อาการแพ้ท้องเริ่มทุเลา แม่ท้องก็ต้องเลือกทานมากขึ้น เพื่อให้อาหารส่งต่อไปให้ทารกในครรภ์"
    }
   

























































































  ]
}
